'''
(!!!Подсказка на следующие 5 задач - превратите число в строку, а потом работайте с строкой)
Задача 6
Найти сумму цифр числа.
    Пример:
    254314
    Сумма цифр числа - 19(2+5+4+3+1+4)
'''

# print('---------------------------Задача 6---------------------------')
# number = input('Введите число: ')
# my_sum = 0
# for i in range(len(number)):
#     my_sum += int(number[i])
# print(f'Сумма цифр в этом числе равна {my_sum} ')
#
# print('---------------------------Задача 6---------------------------')

'''
Задача 7
Найти произведение цифр числа.
    Пример:
    254314
    Произведение цифр числа - 480(2*5*4*3*1*4)
'''
# print('---------------------------Задача 7---------------------------')
# number = input('Введите число: ')
# my_prod = 1
# for i in range(len(number)):
#     my_prod *= int(number[i])
# print(f'Произведение цифр в этом числе равно {my_prod} ')
#
# print('---------------------------Задача 7---------------------------')
'''
Задача 8
Пользователь должен ввести число. Ваш код должен дать ответ на вопрос: есть ли среди цифр числа 5?
Если есть, код должен вывексти "Цифра 5 есть в числе", в противном случае вывести: "Цифры 5 нет в числе".
'''
# print('---------------------------Задача 8---------------------------')
# number = input('Введите число: ')
# counter = 0
# for i in range(len(number)):
#     if int(number[i]) == 5:
#         counter += 1
#         break
# if counter == 0:
#     print('Цифры "5" нет в числе')
# else:
#     print("Цифра '5' есть в числе")
# print('---------------------------Задача 8---------------------------')

'''
Задача 9
Найти максимальную цифру в числе
Пример:
    354359688
    'Цифра - 9 максимальная в числе 354359688'
'''

# print('---------------------------Задача 9---------------------------')
# number = input('Введите число: ')
# max_numeral = 0
# for i in range(len(number)):
#     if int(number[i]) >= max_numeral:
#         max_numeral = int(number[i])
# print(f'Максимальная цифра в этом числе: {max_numeral}')
# print('---------------------------Задача 9---------------------------')

'''
Задача 10
Найти количество цифр 5 в числе
    Пример:
        543231235643
        'В числе 2 5-ки.'
'''

# print('---------------------------Задача 10---------------------------')
# number = input('Введите число: ')
# counter = 0
# for i in range(len(number)):
#     if int(number[i]) == 5:
#         counter += 1
# print(f'В этом числе {counter} цифр "5"')
# print('---------------------------Задача 10---------------------------')